"""
- 단일표본 t검정(One-sample t-test): 목적: 단일 모집단의 평균값이 특정 기준값(또는 예상값)과 다른지를 판단하기 위한 검정.
* 가설 설정
1) 귀무가설(H0): 모집단의 평균 = 기준값
2) 대립가설(H1): 모집단의 평균 ≠ 기준값

- 독립표본 t검정(Independent two-sample t-test): 두 독립된 집단의 평균값이 서로 다른지를 판단하기 위한 검정.
* 가설 설정
1) 귀무가설 (H0): 집단 A의 평균 = 집단 B의 평균
2) 대립가설 (H1): 집단 A의 평균 ≠ 집단 B의 평균
* 가정: 독립성, 정규성 확인, 등분산성 확인

- ANOVA(분산분석): 세 개 이상의 집단의 평균값이 서로 동일한지를 판단하기 위한 검정.
* 가설 설정:
1) 귀무가설(H0): 모든 집단의 평균은 동일.
2) 대립가설(H1): 적어도 한 집단의 평균은 다름.

- 카이제곱 검정(Chi-squared test): 두 범주형 변수의 독립성을 판단하기 위한 검정. 빈도 또는 비율의 차이를 검정하는데 사용됨.
* 가설 설정
1) 귀무가설 (H0): 두 범주형 변수는 독립적이다.
2) 대립가설 (H1): 두 범주형 변수는 독립적이지 않다.

- 상관분석 (Correlation Analysis): 두 연속형 변수 간의 선형적 관계의 강도와 방향을 측정함.
* 결과 해석
1) 상관계수 값은 -1과 1 사이에 있으며, 0에 가까울수록 두 변수 간의 관계가 약하고, -1 또는 1에 가까울수록 강한 관계를 나타냅니다.
2) 부호는 방향성을 나타냅니다. 양의 상관은 한 변수가 증가할 때 다른 변수도 증가하는 경향을, 음의 상관은 한 변수가 증가할 때 다른 변수가 감소하는 경향을 나타냅니다.

- 가설 점정 순서
1. 가설 수립
2. 판단 기준 수립
3. 통계 기법 도출
4. 분석 통계량 산출
5. 판단 기준
6. 결과 도출
"""
